tap "homebrew/bundle"
tap "martido/brew-graph"

brew "awscli"
brew "bash-completion"
brew "brew-graph"

# C/C++ development
brew "boost"
brew "boost-python"
brew "cmake"
brew "clang-format"
brew "cppcheck"
brew "glog"

brew "dark-mode"
brew "fish"
brew "fftw"
brew "gcc"
brew "ghostscript"
brew "go"
brew "graphviz"
brew "git"
brew "hdf5"
brew "htop"
brew "leveldb"
brew "llvm"
brew "lua"
brew "neovim"
brew "node"
brew "openblas"
brew "openssl@1.1"
# brew "opencv"
brew "perl"
brew "protobuf"
brew "pdf2svg"
brew "pyenv"
# brew "pypy"
brew "pypy3"
brew "python"
brew "python3"
brew "pipenv"
brew "ruby"
brew "tmux"
brew "wget"
brew "zeromq"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"


#-----------------------------------------------
# below shows dependencies included by the above
# digraph G {
#   "autoconf";
#   "automake" [style=filled];
#   "awscli" [style=filled];
#   "bash-completion" [style=filled];
#   "boost";
#   "boost-python" [style=filled];
#   "martido/brew-graph/brew-graph" [style=filled];
#   "cairo";
#   "clang-format" [style=filled];
#   "clblast" [style=filled];
#   "cmake" [style=filled];
#   "cppcheck" [style=filled];
#   "dark-mode" [style=filled];
#   "eigen";
#   "ffmpeg";
#   "fftw" [style=filled];
#   "fish" [style=filled];
#   "fontconfig";
#   "freetype";
#   "gcc";
#   "gd";
#   "gdbm";
#   "gettext";
#   "gflags";
#   "ghostscript" [style=filled];
#   "git" [style=filled];
#   "glib";
#   "glog" [style=filled];
#   "gmp";
#   "go" [style=filled];
#   "gperftools";
#   "graphviz" [style=filled];
#   "hdf5" [style=filled];
#   "htop" [style=filled];
#   "icu4c";
#   "ilmbase";
#   "isl";
#   "jemalloc";
#   "jpeg";
#   "lame";
#   "leveldb" [style=filled];
#   "libevent";
#   "libffi";
#   "libidn2";
#   "libmpc";
#   "libogg";
#   "libpng";
#   "libtermkey";
#   "libtiff";
#   "libtool";
#   "libunistring";
#   "libuv";
#   "libvorbis";
#   "libvpx";
#   "libvterm";
#   "libyaml";
#   "little-cms2";
#   "lmdb" [style=filled];
#   "lua" [style=filled];
#   "luajit";
#   "mpfr";
#   "msgpack";
#   "ncurses";
#   "neovim" [style=filled];
#   "node" [style=filled];
#   "nspr";
#   "nss";
#   "numpy";
#   "openblas";
#   "opencv" [style=filled];
#   "openexr";
#   "openjpeg";
#   "openssl";
#   "openssl@1.1" [style=filled];
#   "opus";
#   "pcre";
#   "pcre2";
#   "pdf2svg" [style=filled];
#   "perl" [style=filled];
#   "pipenv" [style=filled];
#   "pixman";
#   "pkg-config";
#   "poppler";
#   "protobuf" [style=filled];
#   "pyenv" [style=filled];
#   "pypy" [style=filled];
#   "pypy3" [style=filled];
#   "python";
#   "python@2";
#   "readline";
#   "ruby" [style=filled];
#   "sdl2";
#   "snappy";
#   "sqlite";
#   "szip";
#   "tbb";
#   "theora";
#   "tmux" [style=filled];
#   "unibilium";
#   "webp";
#   "wget" [style=filled];
#   "x264";
#   "x265";
#   "xvid";
#   "xz";
#   "zeromq" [style=filled];
#   "zlib" [style=filled];
#   "zsh" [style=filled];
#   "zsh-autosuggestions" [style=filled];
#   "zsh-completions" [style=filled];
#   "automake" -> "autoconf";
#   "awscli" -> "gdbm";
#   "awscli" -> "openssl";
#   "awscli" -> "python";
#   "awscli" -> "readline";
#   "awscli" -> "sqlite";
#   "awscli" -> "xz";
#   "boost-python" -> "boost";
#   "cairo" -> "fontconfig";
#   "cairo" -> "freetype";
#   "cairo" -> "gettext";
#   "cairo" -> "glib";
#   "cairo" -> "libffi";
#   "cairo" -> "libpng";
#   "cairo" -> "pcre";
#   "cairo" -> "pixman";
#   "cppcheck" -> "pcre";
#   "ffmpeg" -> "lame";
#   "ffmpeg" -> "libogg";
#   "ffmpeg" -> "libvorbis";
#   "ffmpeg" -> "libvpx";
#   "ffmpeg" -> "opus";
#   "ffmpeg" -> "sdl2";
#   "ffmpeg" -> "snappy";
#   "ffmpeg" -> "theora";
#   "ffmpeg" -> "x264";
#   "ffmpeg" -> "x265";
#   "ffmpeg" -> "xvid";
#   "ffmpeg" -> "xz";
#   "fftw" -> "gcc";
#   "fftw" -> "gmp";
#   "fftw" -> "isl";
#   "fftw" -> "libmpc";
#   "fftw" -> "mpfr";
#   "fish" -> "pcre2";
#   "fontconfig" -> "freetype";
#   "fontconfig" -> "libpng";
#   "freetype" -> "libpng";
#   "gcc" -> "gmp";
#   "gcc" -> "isl";
#   "gcc" -> "libmpc";
#   "gcc" -> "mpfr";
#   "gd" -> "fontconfig";
#   "gd" -> "freetype";
#   "gd" -> "jpeg";
#   "gd" -> "libpng";
#   "gd" -> "libtiff";
#   "gd" -> "webp";
#   "ghostscript" -> "jpeg";
#   "ghostscript" -> "libtiff";
#   "git" -> "gettext";
#   "git" -> "pcre2";
#   "glib" -> "gettext";
#   "glib" -> "libffi";
#   "glib" -> "pcre";
#   "glog" -> "gflags";
#   "graphviz" -> "fontconfig";
#   "graphviz" -> "freetype";
#   "graphviz" -> "gd";
#   "graphviz" -> "jpeg";
#   "graphviz" -> "libpng";
#   "graphviz" -> "libtiff";
#   "graphviz" -> "libtool";
#   "graphviz" -> "webp";
#   "hdf5" -> "gcc";
#   "hdf5" -> "gmp";
#   "hdf5" -> "isl";
#   "hdf5" -> "libmpc";
#   "hdf5" -> "mpfr";
#   "hdf5" -> "szip";
#   "isl" -> "gmp";
#   "leveldb" -> "gperftools";
#   "leveldb" -> "snappy";
#   "libevent" -> "openssl";
#   "libidn2" -> "gettext";
#   "libidn2" -> "libunistring";
#   "libmpc" -> "gmp";
#   "libmpc" -> "mpfr";
#   "libtiff" -> "jpeg";
#   "libvorbis" -> "libogg";
#   "little-cms2" -> "jpeg";
#   "little-cms2" -> "libtiff";
#   "mpfr" -> "gmp";
#   "neovim" -> "gettext";
#   "neovim" -> "jemalloc";
#   "neovim" -> "libtermkey";
#   "neovim" -> "libuv";
#   "neovim" -> "libvterm";
#   "neovim" -> "luajit";
#   "neovim" -> "msgpack";
#   "neovim" -> "unibilium";
#   "node" -> "icu4c";
#   "nss" -> "nspr";
#   "numpy" -> "gcc";
#   "numpy" -> "gdbm";
#   "numpy" -> "gmp";
#   "numpy" -> "isl";
#   "numpy" -> "libmpc";
#   "numpy" -> "mpfr";
#   "numpy" -> "openblas";
#   "numpy" -> "openssl";
#   "numpy" -> "python";
#   "numpy" -> "python@2";
#   "numpy" -> "readline";
#   "numpy" -> "sqlite";
#   "numpy" -> "xz";
#   "openblas" -> "gcc";
#   "openblas" -> "gmp";
#   "openblas" -> "isl";
#   "openblas" -> "libmpc";
#   "openblas" -> "mpfr";
#   "opencv" -> "eigen";
#   "opencv" -> "ffmpeg";
#   "opencv" -> "gcc";
#   "opencv" -> "gdbm";
#   "opencv" -> "gmp";
#   "opencv" -> "ilmbase";
#   "opencv" -> "isl";
#   "opencv" -> "jpeg";
#   "opencv" -> "lame";
#   "opencv" -> "libmpc";
#   "opencv" -> "libogg";
#   "opencv" -> "libpng";
#   "opencv" -> "libtiff";
#   "opencv" -> "libvorbis";
#   "opencv" -> "libvpx";
#   "opencv" -> "mpfr";
#   "opencv" -> "numpy";
#   "opencv" -> "openblas";
#   "opencv" -> "openexr";
#   "opencv" -> "openssl";
#   "opencv" -> "opus";
#   "opencv" -> "python";
#   "opencv" -> "python@2";
#   "opencv" -> "readline";
#   "opencv" -> "sdl2";
#   "opencv" -> "snappy";
#   "opencv" -> "sqlite";
#   "opencv" -> "tbb";
#   "opencv" -> "theora";
#   "opencv" -> "x264";
#   "opencv" -> "x265";
#   "opencv" -> "xvid";
#   "opencv" -> "xz";
#   "openexr" -> "ilmbase";
#   "openjpeg" -> "jpeg";
#   "openjpeg" -> "libpng";
#   "openjpeg" -> "libtiff";
#   "openjpeg" -> "little-cms2";
#   "pdf2svg" -> "cairo";
#   "pdf2svg" -> "fontconfig";
#   "pdf2svg" -> "freetype";
#   "pdf2svg" -> "gettext";
#   "pdf2svg" -> "glib";
#   "pdf2svg" -> "jpeg";
#   "pdf2svg" -> "libffi";
#   "pdf2svg" -> "libpng";
#   "pdf2svg" -> "libtiff";
#   "pdf2svg" -> "little-cms2";
#   "pdf2svg" -> "nspr";
#   "pdf2svg" -> "nss";
#   "pdf2svg" -> "openjpeg";
#   "pdf2svg" -> "pcre";
#   "pdf2svg" -> "pixman";
#   "pdf2svg" -> "poppler";
#   "pipenv" -> "gdbm";
#   "pipenv" -> "openssl";
#   "pipenv" -> "python";
#   "pipenv" -> "readline";
#   "pipenv" -> "sqlite";
#   "pipenv" -> "xz";
#   "poppler" -> "cairo";
#   "poppler" -> "fontconfig";
#   "poppler" -> "freetype";
#   "poppler" -> "gettext";
#   "poppler" -> "glib";
#   "poppler" -> "jpeg";
#   "poppler" -> "libffi";
#   "poppler" -> "libpng";
#   "poppler" -> "libtiff";
#   "poppler" -> "little-cms2";
#   "poppler" -> "nspr";
#   "poppler" -> "nss";
#   "poppler" -> "openjpeg";
#   "poppler" -> "pcre";
#   "poppler" -> "pixman";
#   "protobuf" -> "gdbm";
#   "protobuf" -> "openssl";
#   "protobuf" -> "python";
#   "protobuf" -> "python@2";
#   "protobuf" -> "readline";
#   "protobuf" -> "sqlite";
#   "protobuf" -> "xz";
#   "pyenv" -> "autoconf";
#   "pyenv" -> "openssl";
#   "pyenv" -> "pkg-config";
#   "pyenv" -> "readline";
#   "pypy" -> "gdbm";
#   "pypy" -> "openssl";
#   "pypy" -> "sqlite";
#   "pypy3" -> "gdbm";
#   "pypy3" -> "openssl";
#   "pypy3" -> "sqlite";
#   "pypy3" -> "xz";
#   "python" -> "gdbm";
#   "python" -> "openssl";
#   "python" -> "readline";
#   "python" -> "sqlite";
#   "python" -> "xz";
#   "python@2" -> "gdbm";
#   "python@2" -> "openssl";
#   "python@2" -> "readline";
#   "python@2" -> "sqlite";
#   "ruby" -> "libyaml";
#   "ruby" -> "openssl";
#   "ruby" -> "readline";
#   "sqlite" -> "readline";
#   "tbb" -> "gdbm";
#   "tbb" -> "openssl";
#   "tbb" -> "python@2";
#   "tbb" -> "readline";
#   "tbb" -> "sqlite";
#   "theora" -> "libogg";
#   "theora" -> "libvorbis";
#   "tmux" -> "libevent";
#   "tmux" -> "openssl";
#   "webp" -> "jpeg";
#   "webp" -> "libpng";
#   "wget" -> "gettext";
#   "wget" -> "libidn2";
#   "wget" -> "libunistring";
#   "wget" -> "openssl";
#   "zsh" -> "ncurses";
# }
