brew "awscli"
brew "bash-completion"
brew "cmake"
brew "dark-mode"
brew "fish"
brew "gcc"
brew "go"
brew "graphviz"
brew "git"
brew "htop"
brew "llvm"
brew "lua"
brew "neovim"
brew "node"
brew "openblas"
brew "openssl@1.1"
brew "perl"
brew "pyenv"
brew "pypy"
brew "pypy3"
brew "python"
brew "python3"
brew "pipenv"
brew "ruby"
brew "tmux"
brew "wget"
brew "zeromq"
brew "zlib"
brew "zsh-completions"

#-----------------------------------------------
# below shows dependencies included by the above
#
#  graphviz
#    libtool
#    gd
#    fontconfig
#    freetype
#    webp
#    libtiff
#    libpng
#    jpeg
#  neovim
#    cmake
#    lua@5.1
#    pkg-config
#    gettext
#    gemalloc
#    libtermkey
#    libuv
#    libvterm
#    luajit
#    msgpack
#    unibilium
#  openblas
#    gcc
#    libmpc
#    isl
#    mpfr
#    gmp
#  python/python3/pypy/pypy3
#    gdbm
#    openssl
#    sqlite
#    readline
#    xz
#  pyenv
#    autoconf
#    pkg-config
#    openssl
#    readline
#  wget
#    libdn2
#    libunistring
#    gettext
#    openssl
#  tmux
#    libevent
#    openssl
#  awscli
#    python3
#  node
#    icu4c
#  llvm
#    libffi
#  fish
#    pcre2
#  bash-completion
#  git
#  go
#  htop
#  lua
#  openssl@1.1
#  zeromq
#  zlib
