tap "homebrew/versions"
tap "homebrew/science"

brew "htop"
brew "tmux"
brew "gcc"
brew "wget"
brew "node"
brew "pyenv"
brew "pypy"
brew "pypy3"
brew "python3"
brew "cmake"
brew "dark-mode"
#brew "fontconfig"
brew "bash-completion"
brew "awscli"
#brew "go"
brew "docker"
brew "docker-clean"
brew "docker-compose"
brew "docker-machine"
brew "qt"
brew "zeromq"
#brew "openblas"
