bcmarinacci.theme-material
bogdan-sinitsa.theme-dark-monokai
DavidAnson.vscode-markdownlint
ms-python.python
Equinusocio.vsc-material-theme
formulahendry.code-runner
goessner.mdmath
himanoa.Python-autopep8
jaysonsantos.vscode-flake8
jebbs.plantuml
lextudio.restructuredtext
magicstack.MagicPython
mauve.terraform
ms-vscode.cpptools
ms-vscode.sublime-keybindings
PeterJausovec.vscode-docker
PKief.material-icon-theme
rust-lang.rust
tht13.python
twxs.cmake
vscodevim.vim
wholroyd.jinja
